{"website": "", "description": "\nThis module lets users enter the banking details of Partners in the RIB format (French standard for bank accounts details).\n===========================================================================================================================\n\nRIB Bank Accounts can be entered in the \"Accounting\" tab of the Partner form by specifying the account type \"RIB\". \n\nThe four standard RIB fields will then become mandatory:\n--------------------------------------------------------    \n    - Bank Code\n    - Office Code\n    - Account number\n    - RIB key\n    \nAs a safety measure, OpenERP will check the RIB key whenever a RIB is saved, and\nwill refuse to record the data if the key is incorrect. Please bear in mind that\nthis can only happen when the user presses the 'save' button, for example on the\nPartner Form. Since each bank account may relate to a Bank, users may enter the\nRIB Bank Code in the Bank form - it will the pre-fill the Bank Code on the RIB\nwhen they select the Bank. To make this easier, this module will also let users\nfind Banks using their RIB code.\n\nThe module base_iban can be a useful addition to this module, because French banks\nare now progressively adopting the international IBAN format instead of the RIB format.\nThe RIB and IBAN codes for a single account can be entered by recording two Bank\nAccounts in OpenERP: the first with the type 'RIB', the second with the type 'IBAN'. \n", "sequence": 100, "demo": [], "depends": ["account", "base_iban"], "auto_install": false, "data": ["bank_data.xml", "bank_view.xml"], "demo_xml": [], "icon": "/base/static/description/icon.png", "category": "Hidden/Dependency", "web": false, "init_xml": [], "name": "French RIB Bank Details", "license": "AGPL-3", "author": "Numérigraphe SARL", "update_xml": [], "summary": "", "application": false, "version": "8.0.1.0", "post_load": null, "test": [], "module_path": "/mnt/data/home/mdupont/experiments/odoo/addons/l10n_fr_rib", "installable": true}