{"website": "https://www.odoo.com/page/mailing", "description": "\nEmail Templating (simplified version of the original Power Email by Openlabs).\n==============================================================================\n\nLets you design complete email templates related to any OpenERP document (Sale\nOrders, Invoices and so on), including sender, recipient, subject, body (HTML and\nText). You may also automatically attach files to your templates, or print and\nattach a report.\n\nFor advanced use, the templates may include dynamic attributes of the document\nthey are related to. For example, you may use the name of a Partner's country\nwhen writing to them, also providing a safe default in case the attribute is\nnot defined. Each template contains a built-in assistant to help with the\ninclusion of these dynamic values.\n\nIf you enable the option, a composition assistant will also appear in the sidebar\nof the OpenERP documents to which the template applies (e.g. Invoices).\nThis serves as a quick way to send a new email based on the template, after\nreviewing and adapting the contents, if needed.\nThis composition assistant will also turn into a mass mailing system when called\nfor multiple documents at once.\n\nThese email templates are also at the heart of the marketing campaign system\n(see the ``marketing_campaign`` application), if you need to automate larger\ncampaigns on any OpenERP document.\n\n    **Technical note:** only the templating system of the original Power Email by Openlabs was kept.\n    ", "sequence": 100, "demo": [], "depends": ["mail"], "auto_install": true, "data": ["wizard/email_template_preview_view.xml", "email_template_view.xml", "res_partner_view.xml", "ir_actions_view.xml", "wizard/mail_compose_message_view.xml", "security/ir.model.access.csv"], "demo_xml": [], "icon": "/base/static/description/icon.png", "category": "Marketing", "web": false, "init_xml": [], "name": "Email Templates", "license": "AGPL-3", "author": "OpenERP SA", "update_xml": [], "summary": "", "application": false, "version": "8.0.1.1", "post_load": null, "test": [], "module_path": "/mnt/data/home/mdupont/experiments/odoo/addons/email_template", "installable": true}