{"website": "https://www.odoo.com", "external_dependencies": {"python": ["ldap"]}, "description": "Adds support for authentication by LDAP server.\n===============================================\nThis module allows users to login with their LDAP username and password, and\nwill automatically create OpenERP users for them on the fly.\n\n**Note:** This module only work on servers who have Python's ``ldap`` module installed.\n\nConfiguration:\n--------------\nAfter installing this module, you need to configure the LDAP parameters in the\nConfiguration tab of the Company details. Different companies may have different\nLDAP servers, as long as they have unique usernames (usernames need to be unique\nin OpenERP, even across multiple companies).\n\nAnonymous LDAP binding is also supported (for LDAP servers that allow it), by\nsimply keeping the LDAP user and password empty in the LDAP configuration.\nThis does not allow anonymous authentication for users, it is only for the master\nLDAP account that is used to verify if a user exists before attempting to\nauthenticate it.\n\nSecuring the connection with STARTTLS is available for LDAP servers supporting\nit, by enabling the TLS option in the LDAP configuration.\n\nFor further options configuring the LDAP settings, refer to the ldap.conf\nmanpage: manpage:`ldap.conf(5)`.\n\nSecurity Considerations:\n------------------------\nUsers' LDAP passwords are never stored in the OpenERP database, the LDAP server\nis queried whenever a user needs to be authenticated. No duplication of the\npassword occurs, and passwords are managed in one place only.\n\nOpenERP does not manage password changes in the LDAP, so any change of password\nshould be conducted by other means in the LDAP directory directly (for LDAP users).\n\nIt is also possible to have local OpenERP users in the database along with\nLDAP-authenticated users (the Administrator account is one obvious example).\n\nHere is how it works:\n---------------------\n    * The system first attempts to authenticate users against the local OpenERP\n      database;\n    * if this authentication fails (for example because the user has no local\n      password), the system then attempts to authenticate against LDAP;\n\nAs LDAP users have blank passwords by default in the local OpenERP database\n(which means no access), the first step always fails and the LDAP server is\nqueried to do the authentication.\n\nEnabling STARTTLS ensures that the authentication query to the LDAP server is\nencrypted.\n\nUser Template:\n--------------\nIn the LDAP configuration on the Company form, it is possible to select a *User\nTemplate*. If set, this user will be used as template to create the local users\nwhenever someone authenticates for the first time via LDAP authentication. This\nallows pre-setting the default groups and menus of the first-time users.\n\n**Warning:** if you set a password for the user template, this password will be\n         assigned as local password for each new LDAP user, effectively setting\n         a *master password* for these users (until manually changed). You\n         usually do not want this. One easy way to setup a template user is to\n         login once with a valid LDAP user, let OpenERP create a blank local\n         user with the same login (and a blank password), then rename this new\n         user to a username that does not exist in LDAP, and setup its groups\n", "sequence": 100, "demo": [], "depends": ["base"], "auto_install": false, "data": ["users_ldap_view.xml", "user_ldap_installer.xml", "security/ir.model.access.csv"], "demo_xml": [], "icon": "/base/static/description/icon.png", "category": "Authentication", "web": false, "init_xml": [], "name": "Authentication via LDAP", "license": "AGPL-3", "author": "OpenERP SA", "update_xml": [], "summary": "", "application": false, "version": "8.0.1.0", "post_load": null, "test": [], "module_path": "/mnt/data/home/mdupont/experiments/odoo/addons/auth_ldap", "installable": true}