{"website": "https://www.odoo.com/page/accounting", "description": "\nVAT validation for Partner's VAT numbers.\n=========================================\n\nAfter installing this module, values entered in the VAT field of Partners will\nbe validated for all supported countries. The country is inferred from the\n2-letter country code that prefixes the VAT number, e.g. ``BE0477472701``\nwill be validated using the Belgian rules.\n\nThere are two different levels of VAT number validation:\n--------------------------------------------------------\n    * By default, a simple off-line check is performed using the known validation\n      rules for the country, usually a simple check digit. This is quick and \n      always available, but allows numbers that are perhaps not truly allocated,\n      or not valid anymore.\n      \n    * When the \"VAT VIES Check\" option is enabled (in the configuration of the user's\n      Company), VAT numbers will be instead submitted to the online EU VIES\n      database, which will truly verify that the number is valid and currently\n      allocated to a EU company. This is a little bit slower than the simple\n      off-line check, requires an Internet connection, and may not be available\n      all the time. If the service is not available or does not support the\n      requested country (e.g. for non-EU countries), a simple check will be performed\n      instead.\n\nSupported countries currently include EU countries, and a few non-EU countries\nsuch as Chile, Colombia, Mexico, Norway or Russia. For unsupported countries,\nonly the country code will be validated.\n    ", "sequence": 100, "demo": [], "depends": ["account"], "auto_install": false, "data": ["base_vat_view.xml"], "demo_xml": [], "icon": "/base/static/description/icon.png", "category": "Hidden/Dependency", "web": false, "init_xml": [], "name": "VAT Number Validation", "license": "AGPL-3", "author": "OpenERP SA", "update_xml": [], "summary": "", "application": false, "version": "8.0.1.0", "post_load": null, "test": [], "module_path": "/mnt/data/home/mdupont/experiments/odoo/addons/base_vat", "installable": true}